model2 None
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cropping2d_1 (Cropping2D)    (None, 100, 320, 3)       0         
_________________________________________________________________
lambda_1 (Lambda)            (None, 100, 320, 3)       0         
_________________________________________________________________
input_1 (InputLayer)         (None, 100, 320, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 100, 320, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 100, 320, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 50, 160, 64)       0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 50, 160, 128)      73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 50, 160, 128)      147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 25, 80, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 25, 80, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 25, 80, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 25, 80, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 12, 40, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 12, 40, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 12, 40, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 12, 40, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 6, 20, 512)        0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 3, 10, 512)        2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 3, 5, 512)         2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 3, 3, 512)         2359808   
_________________________________________________________________
flatten_1 (Flatten)          (None, 4608)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4608)              0         
_________________________________________________________________
fc1 (Dense)                  (None, 2048)              9439232   
_________________________________________________________________
dropout_2 (Dropout)          (None, 2048)              0         
_________________________________________________________________
fc2 (Dense)                  (None, 1024)              2098176   
_________________________________________________________________
dropout_3 (Dropout)          (None, 1024)              0         
_________________________________________________________________
predictions (Dense)          (None, 1)                 1025      
=================================================================
Total params: 26,253,121
Trainable params: 18,617,857
Non-trainable params: 7,635,264
_________________________________________________________________